vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.SAME54_DFP.pdsc
      <condition id="ATSAME54P20A">
         <require Dvendor="Microchip:3" Dname="ATSAME54P20A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME54P19A">
         <require Dvendor="Microchip:3" Dname="ATSAME54P19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME54N20A">
         <require Dvendor="Microchip:3" Dname="ATSAME54N20A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME54N19A">
         <require Dvendor="Microchip:3" Dname="ATSAME54N19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAME54P20A">
         <description>Headers and startup code for Microchip ATSAME54P20A</description>
         <files>
            <file condition="C" category="include" name="include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/system_same54.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/gcc/startup_same54.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="gcc/gcc/same54p20a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="gcc/gcc/same54p20a_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/system_same54.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/iar/startup_same54.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="iar/iar/same54p20a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="iar/iar/same54p20a_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/system_same54.c"
                  version="0.1.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/arm/startup_same54.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAME54P19A">
         <description>Headers and startup code for Microchip ATSAME54P19A</description>
         <files>
            <file condition="C" category="include" name="include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/system_same54.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/gcc/startup_same54.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="gcc/gcc/same54p19a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="gcc/gcc/same54p19a_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/system_same54.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/iar/startup_same54.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="iar/iar/same54p19a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="iar/iar/same54p19a_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/system_same54.c"
                  version="0.1.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/arm/startup_same54.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAME54N20A">
         <description>Headers and startup code for Microchip ATSAME54N20A</description>
         <files>
            <file condition="C" category="include" name="include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/system_same54.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/gcc/startup_same54.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="gcc/gcc/same54n20a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="gcc/gcc/same54n20a_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/system_same54.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/iar/startup_same54.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="iar/iar/same54n20a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="iar/iar/same54n20a_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/system_same54.c"
                  version="0.1.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/arm/startup_same54.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAME54N19A">
         <description>Headers and startup code for Microchip ATSAME54N19A</description>
         <files>
            <file condition="C" category="include" name="include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/system_same54.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/gcc/startup_same54.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="gcc/gcc/same54n19a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="gcc/gcc/same54n19a_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/system_same54.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/iar/startup_same54.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="iar/iar/same54n19a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="iar/iar/same54n19a_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/system_same54.c"
                  version="0.1.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="arm_addon/armcc/arm/startup_same54.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>

    <!-- SAME54-XPRO Board Support -->   <!-- added by ARM -->
    <bundle Cbundle="SAME54-XPRO" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip SAME54-XPRO Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="ATSAME54P20A">
      <description>LED driver for Microchip SAME54-XPRO Board</description>
        <files>
          <file category="source" name="arm_addon/boards/Microchip/SAME54-XPRO/Common/LED_SAME54-XPRO.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="ATSAME54P20A">
      <description>Button driver for Microchip SAME54-XPRO Board</description>
        <files>
          <file category="source" name="arm_addon/boards/Microchip/SAME54-XPRO/Common/Buttons_SAME54-XPRO.c"/>
        </files>
      </component>
    </bundle>
   </components>

  <boards>   <!-- added by ARM -->
    <board vendor="Microchip" name="SAME54-XPRO" revision="Rev.1" salesContact="https://www.microchipdirect.com/" orderForm="https://www.microchipdirect.com/product/search/all/atsame54-xpro">
      <description>Microchip SAM D51 Xplained Pro Evaluation Kit</description>
      <image small="arm_addon/boards/Microchip/SAME54-XPRO/Documents/SAME54-XPRO_small.png"
             large="arm_addon/boards/Microchip/SAME54-XPRO/Documents/SAME54-XPRO_large.png"/>
      <book category="overview"  name="http://www.microchip.com/developmenttools/productdetails.aspx?partno=atsame54-xpro" title="SAM E54 Xplained Pro Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAME54P20A"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" Dfamily="SAME54"/>
	    <feature type="ODbg"      n="1"              name="Embedded Debugger USB"/>
		<feature type="XTAL"      n="32768"/>
	    <feature type="PWR"       n="5"              name="USB Powered (from the Debugger)"/>
	    <feature type="PWR"       n="5"              name="External Power"/>
	    <feature type="DIO"       n="3"              name="Xplained Pro Extension headers"/>
	    <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
	    <feature type="LED"       n="1"              name="Yellow User LED"/>
	    <feature type="USB"       n="1"              name="Target USB"/>
	    <feature type="MemCard"   n="1"              name="SD Card"/>
	    <feature type="CustomFF"  n="60" m="100"/>
      <debugInterface adapter="Embedded Debugger" connector="Micro-USB"/>
    </board>
  </boards>

  <examples>   <!-- added by ARM -->
    <!-- SAME54-XPRO Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="arm_addon/boards/Microchip/SAME54-XPRO/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="SAME54-XPRO" vendor="Microchip"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS2"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
</package>
